app/controllers/cadproject_controller.rb

    def find_item
      @project = CadProjeto.find(params[:id])
---
SELECT  "cad_projetos".* FROM "cad_projetos" WHERE "cad_projetos"."id" = $1 LIMIT 1  [["id", nil]]