app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"  ORDER BY created_at DESC
---
  def index
    @projects = Project.all.order('created_at DESC')

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 3]]
---
  def find_project
    @project= Project.find(params[:id])